src/main/java/ru/vk/itmo/test/bandurinvladislav/results/stage2/profile_wrk/put_R160k
 wrk -d 30 -t 8 -c 64 -R 160000 -L -s ./scripts/PutRequest.lua http://localhost:8080
Running 30s test @ http://localhost:8080
  8 threads and 64 connections
  Thread calibration: mean lat.: 6.454ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.149ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.575ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.452ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.535ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.204ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.461ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6.685ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.48ms    1.75ms  43.87ms   94.94%
    Req/Sec    21.11k     2.58k   42.22k    80.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.17ms
 75.000%    1.74ms
 90.000%    2.34ms
 99.000%    9.15ms
 99.900%   21.04ms
 99.990%   32.99ms
 99.999%   40.74ms
100.000%   43.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.019     0.000000            4         1.00
       0.367     0.100000       319467         1.11
       0.598     0.200000       640112         1.25
       0.816     0.300000       959544         1.43
       1.000     0.400000      1277726         1.67
       1.171     0.500000      1596872         2.00
       1.264     0.550000      1756702         2.22
       1.367     0.600000      1917532         2.50
       1.480     0.650000      2075957         2.86
       1.603     0.700000      2235966         3.33
       1.740     0.750000      2395822         4.00
       1.811     0.775000      2475118         4.44
       1.890     0.800000      2555652         5.00
       1.973     0.825000      2635465         5.71
       2.067     0.850000      2715329         6.67
       2.183     0.875000      2795282         8.00
       2.253     0.887500      2834505         8.89
       2.337     0.900000      2874168        10.00
       2.443     0.912500      2914408        11.43
       2.589     0.925000      2954312        13.33
       2.819     0.937500      2993927        16.00
       3.001     0.943750      3013888        17.78
       3.263     0.950000      3033843        20.00
       3.625     0.956250      3053829        22.86
       4.099     0.962500      3073787        26.67
       4.719     0.968750      3093833        32.00
       5.075     0.971875      3103774        35.56
       5.479     0.975000      3113767        40.00
       5.947     0.978125      3123694        45.71
       6.503     0.981250      3133666        53.33
       7.211     0.984375      3143630        64.00
       7.631     0.985938      3148634        71.11
       8.119     0.987500      3153598        80.00
       8.719     0.989062      3158615        91.43
       9.455     0.990625      3163588       106.67
      10.351     0.992188      3168593       128.00
      10.863     0.992969      3171074       142.22
      11.439     0.993750      3173574       160.00
      12.151     0.994531      3176068       182.86
      12.991     0.995313      3178555       213.33
      13.975     0.996094      3181041       256.00
      14.567     0.996484      3182293       284.44
      15.175     0.996875      3183549       320.00
      15.847     0.997266      3184790       365.71
      16.591     0.997656      3186046       426.67
      17.567     0.998047      3187293       512.00
      18.095     0.998242      3187908       568.89
      18.687     0.998437      3188526       640.00
      19.343     0.998633      3189148       731.43
      20.063     0.998828      3189778       853.33
      21.199     0.999023      3190402      1024.00
      21.855     0.999121      3190716      1137.78
      22.639     0.999219      3191020      1280.00
      23.359     0.999316      3191331      1462.86
      24.319     0.999414      3191649      1706.67
      25.359     0.999512      3191959      2048.00
      25.903     0.999561      3192111      2275.56
      26.447     0.999609      3192268      2560.00
      27.023     0.999658      3192423      2925.71
      27.791     0.999707      3192579      3413.33
      28.719     0.999756      3192737      4096.00
      29.199     0.999780      3192815      4551.11
      29.775     0.999805      3192891      5120.00
      30.479     0.999829      3192969      5851.43
      31.199     0.999854      3193047      6826.67
      32.207     0.999878      3193126      8192.00
      32.671     0.999890      3193166      9102.22
      33.055     0.999902      3193204     10240.00
      33.535     0.999915      3193242     11702.86
      34.687     0.999927      3193281     13653.33
      36.383     0.999939      3193321     16384.00
      36.831     0.999945      3193339     18204.44
      37.439     0.999951      3193359     20480.00
      37.791     0.999957      3193379     23405.71
      38.111     0.999963      3193398     27306.67
      38.463     0.999969      3193417     32768.00
      38.655     0.999973      3193427     36408.89
      38.847     0.999976      3193437     40960.00
      39.071     0.999979      3193447     46811.43
      39.327     0.999982      3193457     54613.33
      39.647     0.999985      3193468     65536.00
      39.903     0.999986      3193471     72817.78
      40.223     0.999988      3193476     81920.00
      40.479     0.999989      3193480     93622.86
      41.023     0.999991      3193485    109226.67
      41.215     0.999992      3193490    131072.00
      41.631     0.999993      3193494    145635.56
      41.919     0.999994      3193496    163840.00
      42.207     0.999995      3193497    187245.71
      42.527     0.999995      3193500    218453.33
      42.783     0.999996      3193502    262144.00
      42.815     0.999997      3193504    291271.11
      43.071     0.999997      3193505    327680.00
      43.103     0.999997      3193506    374491.43
      43.327     0.999998      3193508    436906.67
      43.327     0.999998      3193508    524288.00
      43.615     0.999998      3193510    582542.22
      43.615     0.999998      3193510    655360.00
      43.615     0.999999      3193510    748982.86
      43.839     0.999999      3193511    873813.33
      43.839     0.999999      3193511   1048576.00
      43.871     0.999999      3193512   1165084.44
      43.871     0.999999      3193512   1310720.00
      43.871     0.999999      3193512   1497965.71
      43.903     0.999999      3193514   1747626.67
      43.903     1.000000      3193514          inf
#[Mean    =        1.483, StdDeviation   =        1.747]
#[Max     =       43.872, Total count    =      3193514]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4796894 requests in 30.00s, 306.50MB read
Requests/sec: 159905.33
Transfer/sec:     10.22MB